In [1]:
import pandas as pd

In [2]:
dataFrame = pd.read_csv("datasheet.csv")
dataFrame

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25     Not ava
5    Shan   26         NaN
6    Shwn   29  Javascript
7   Shawn  215         NaN
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [3]:
# Fill NA values with a certain value

dataFrame.fillna(0)

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25     Not ava
5    Shan   26           0
6    Shwn   29  Javascript
7   Shawn  215           0
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [4]:
# Fill NA values of a certain column
dataFrame.fillna({"Name":"None",
                  "Age":0,
                  "Language":"Null"})

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25     Not ava
5    Shan   26        Null
6    Shwn   29  Javascript
7   Shawn  215        Null
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript

In [6]:
dataFrame.fillna(method="ffill")

     Name  Age    Language
0     Raj   20      Python
1   Alice   19        Java
2     Sky   21           C
3   Shawn   25  Javascript
4    Shaw   25     Not ava
5    Shan   26     Not ava
6    Shwn   29  Javascript
7   Shawn  215  Javascript
8    Shwn   25  Javascript
9   Shawn   25  Javascript
10  Shawn   25  Javascript